AUTO_config_TK_pesok/src/Documents/ТК_УстановкаМаркетинга/ТК_УстановкаМаркетинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТК_УстановкаМаркетинга</name>
  <comment>Установка маркетинга по поставщикам</comment>
  <registerRecords>InformationRegister.УстановкаМаркетинга</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Поставщик/комитент от которого мы получили товар</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОтборов</name>
    <comment>Уникальный идентификатор схемы компановки данных</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорВзаиморасчетов</name>
    <comment>Договор, по которому ведутся взаиморасчеты с контрагентом</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаРасчета</name>
    <type>
      <types>EnumRef.СхемыНачисления</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерБонуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипБонуса</name>
    <type>
      <types>CatalogRef.ТипыБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулировкаНачисления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентированныйУчет</name>
    <comment>Флаг отражения документа в регламентированном учете</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Площадки</name>
    <attributes>
      <name>ТорговаяПлощадка</name>
      <type>
        <types>CatalogRef.ТорговыеПлощадки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Enums/СхемыНачисления/СхемыНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СхемыНачисления</name>
  <enumValues>
    <name>ПроцентОтПоставки</name>
  </enumValues>
  <enumValues>
    <name>ПроцентОтОплат</name>
  </enumValues>
  <enumValues>
    <name>ФиксированыйБонус</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Catalogs/ТорговыеПлощадки/ТорговыеПлощадки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТорговыеПлощадки</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьТоварыПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияОС_ТекущиеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияПоКОАТУУ</name>
    <comment>Название и код территории по КОАТУУ, на которой расположен торговая точка</comment>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <comment>Номер маршрута доставки (0 если не торгует)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментнаяМатрица</name>
    <type>
      <types>CatalogRef.АссортиментнаяМатрица</types>
    </type>
  </attributes>
  <attributes>
    <name>АлкоголемНеТоргуем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешительныеДокументы</name>
    <comment>Наличие разрешительных документов по ПБ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСистемаАПС</name>
    <comment>Договор на обслуживание системы АПС</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Потребители</name>
    <comment>Потребители коммунальных услуг</comment>
    <attributes>
      <name>Потребитель</name>
      <comment>Потребитель коммунальных услуг</comment>
      <type>
        <types>DefinedType.ПотребительКоммунальныхУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РекламныеПлоскости</name>
    <attributes>
      <name>Расположение</name>
      <type>
        <types>EnumRef.ПлоскостьПодРекламу</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламныйНоситель</name>
      <type>
        <types>CatalogRef.РекламныеНосители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сюжет</name>
      <type>
        <types>CatalogRef.СюжетыРекламныхНосителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеПоставщиков</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ОборудованиеПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНапитков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Чай</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДверей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУстановки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВывоза</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Огнетушители</name>
    <attributes>
      <name>Огнетушитель</name>
      <type>
        <types>EnumRef.ТипыОгнетушителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСледующегоТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Documents/ТК_УстановкаМаркетинга/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ТК_УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец ТК_УправлениеДоступом
	
	УстановитьСостояниеДокумента();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("ТК_УстановкаМаркетинга"));
	
	ЗаполнитьДеревоТП();
	ЗаполнитьОтборы();

	Если НЕ ЗначениеЗаполнено(Объект.Менеджер) Тогда
		Объект.Менеджер = Пользователи.АвторизованныйПользователь().ФизическоеЛицо;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если  ТекущийОбъект.СхемаРасчета <> Перечисления.СхемыНачисления.ФиксированыйБонус Тогда
		ТекущийОбъект.ХранилищеОтборов = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки(), Новый СжатиеДанных(9));
	КонецЕсли;
	
	ТекущийОбъект.Площадки.Очистить();
	
	тДерево = РеквизитФормыВЗначение("ДеревоТорговыхПлощадок");
	ОбходДерева(тДерево, ТекущийОбъект);
	
	Если ЗначениеЗаполнено(Отборы) Тогда
        ТекущийОбъект.ДополнительныеСвойства.Вставить("Отборы", Отборы);
    КонецЕсли;
	

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// ТК_УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ТК_УправлениеДоступом
	
	УстановитьСостояниеДокумента();

КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ИнициализироватьНастройки();
	Элементы.КомпоновщикНастроекНастройкиОтбор.Доступность = Истина;
	
	Если  Объект.СхемаРасчета = Перечисления.СхемыНачисления.ПроцентОтПоставки Тогда 
		СхемаКомпоновкиДанных = Документы.ТК_УстановкаМаркетинга.ПолучитьМакет("ПроцентОтПоставок");
	ИначеЕсли  Объект.СхемаРасчета = Перечисления.СхемыНачисления.ПроцентОтОплат Тогда
		СхемаКомпоновкиДанных = Документы.ТК_УстановкаМаркетинга.ПолучитьМакет("ПроцентОтОплат");
	Иначе
		КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		Элементы.КомпоновщикНастроекНастройкиОтбор.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор)));	
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Функция получитьзначениеПеречисления (имя)
	возврат Перечисления.СхемыНачисления[имя];	
КонецФункции

&НаСервере
Процедура ОбновитьКоличествоТорговыхПлощадок()
	Попытка
		КолвоТП = ЭтаФорма.ДеревоТорговыхПлощадок.Строки.НайтиСтроки(Новый Структура("ТорговаяПлощадкаВыбрана", Истина), Истина).Количество();
		ЭтаФорма.ДеревоТорговыхПлощадок.Колонки["ТорговаяПлощадка"].ТекстШапки = "Торговые площадки" + ?(КолвоТП = 0, "", " (" + КолвоТП + ")");
	Исключение
		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ОбходДерева(тДерево, ТекущийОбъект);
		
	Для Каждого СтрДерева Из тДерево.Строки Цикл
		Если СтрДерева.ТорговаяПлощадкаВыбрана Тогда
			НоваяСтрока = ТекущийОбъект.Площадки.Добавить();
			НоваяСтрока.ТорговаяПлощадка = СтрДерева.ТорговаяПлощадка;
		КонецЕсли;
					
		Если СтрДерева.Строки.Количество()>0 Тогда
			ОбходДерева(СтрДерева, ТекущийОбъект);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоТП()
	
	ВыбранныеТП = Новый СписокЗначений;
	Для Каждого стр из Объект.Площадки Цикл
		ВыбранныеТП.Добавить(стр.ТорговаяПлощадка);
	КонецЦикла;
	
	ДеревоТП = Новый ДеревоЗначений;
	
	 //создаем колонки
	МассивТипов = Новый Массив(1); МассивТипов[0]=Тип("СправочникСсылка.ТорговыеПлощадки");
	ДеревоТП.Колонки.Добавить("ТорговаяПлощадка", Новый ОписаниеТипов(МассивТипов),"Торговые площадки",35);
	МассивТипов[0]=Тип("Булево");
	ДеревоТП.Колонки.Добавить("ТорговаяПлощадкаВыбрана", Новый ОписаниеТипов(МассивТипов));

	// заполняем строки
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТорговыеПлощадки.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВыбранныеТорговыеПлощадки
	               |ИЗ
	               |	Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
	               |ГДЕ
	               |	ТорговыеПлощадки.Ссылка В(&ВыбранныеТП)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТорговыеПлощадки.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТорговыеПлощадки.Родитель КАК РодительТорговойПлощадки,
	               |	ТорговыеПлощадки.Ссылка КАК ТорговаяПлощадка,
	               |	ВЫБОР
	               |		КОГДА ВыбранныеТорговыеПлощадки.Ссылка ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ТорговаяПлощадкаВыбрана
	               |ИЗ
	               |	Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВыбранныеТорговыеПлощадки КАК ВыбранныеТорговыеПлощадки
	               |		ПО (ВыбранныеТорговыеПлощадки.Ссылка = ТорговыеПлощадки.Ссылка)
	               |ГДЕ
	               |	НЕ ТорговыеПлощадки.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТорговаяПлощадка ИЕРАРХИЯ УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ВыбранныеТП", ВыбранныеТП);
	Выборка = Запрос.Выполнить().Выбрать();
		
	СоответствиеРодителей = Новый Соответствие;
	// добавляем строки в дерево. Иерархически.
	Пока Выборка.Следующий() Цикл
		Если СоответствиеРодителей[Выборка.РодительТорговойПлощадки] = Неопределено Тогда
			ТекСтрока = ДеревоТП.Строки.Добавить();
		Иначе
			ТекСтрока = СоответствиеРодителей[Выборка.РодительТорговойПлощадки].Строки.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТекСтрока, Выборка);
		СоответствиеРодителей.Вставить(Выборка.ТорговаяПлощадка, ТекСтрока);
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДеревоТП, "ДеревоТорговыхПлощадок");

КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОтборы()
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда    
		тОтборы = Параметры.ЗначениеКопирования;
	Иначе
		тОтборы = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СхемаРасчета) Тогда 
		Если  Объект.СхемаРасчета = Перечисления.СхемыНачисления.ПроцентОтПоставки Тогда 
			СхемаКомпоновкиДанных = Документы.ТК_УстановкаМаркетинга.ПолучитьМакет("ПроцентОтПоставок");
		ИначеЕсли  Объект.СхемаРасчета = Перечисления.СхемыНачисления.ПроцентОтОплат Тогда
			СхемаКомпоновкиДанных = Документы.ТК_УстановкаМаркетинга.ПолучитьМакет("ПроцентОтОплат");
		Иначе
			Элементы.КомпоновщикНастроекНастройкиОтбор.Доступность = Ложь;
			Возврат;
		КонецЕсли;
		
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор)));	
		
		НастройкиОтборов = тОтборы.ХранилищеОтборов.Получить();

		Попытка
			КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтборов);
		Исключение
			КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияТК.СостояниеДокумента(Объект);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановкаФлажков(ЭлементКоллекции, ЗначениеПометки)

    ПодчинЭлементы = ЭлементКоллекции.ПолучитьЭлементы();
    Для Каждого ТекЭлемент Из ПодчинЭлементы Цикл
        ТекЭлемент.ТорговаяПлощадкаВыбрана = ЗначениеПометки;
        УстановкаФлажков(ТекЭлемент, ТекЭлемент.ТорговаяПлощадкаВыбрана);
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция УстановленноДляВсех(ЭлементКоллекции)

    СоседниеЭлементы =
        ЭлементКоллекции.ПолучитьРодителя().ПолучитьЭлементы();
    Для Каждого ТекЭлемент Из СоседниеЭлементы Цикл
        Если ТекЭлемент.ТорговаяПлощадкаВыбрана <> ЭлементКоллекции.ТорговаяПлощадкаВыбрана Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла;
    Возврат Истина;

КонецФункции   

&НаКлиенте
Процедура ДеревоТорговыхПлощадокТорговаяПлощадкаВыбранаПриИзменении(Элемент)
	
	ИДТекущейСтроки = Элементы.ДеревоТорговыхПлощадок.ТекущаяСтрока;

    Если ИДТекущейСтроки <> Неопределено Тогда

        ЭлементКоллекции = ЭтаФорма.ДеревоТорговыхПлощадок.НайтиПоИдентификатору(
            ИДТекущейСтроки);

        Если ЭлементКоллекции.ТорговаяПлощадкаВыбрана = 2 Тогда
            ЭлементКоллекции.ТорговаяПлощадкаВыбрана = 0;
        КонецЕсли;

        УстановкаФлажков(ЭлементКоллекции, ЭлементКоллекции.ТорговаяПлощадкаВыбрана);

        Родитель = ЭлементКоллекции.ПолучитьРодителя();
        Пока Родитель <> Неопределено Цикл
            Родитель.ТорговаяПлощадкаВыбрана = ?(УстановленноДляВсех(ЭлементКоллекции),
                ЭлементКоллекции.ТорговаяПлощадкаВыбрана, 2);
            ЭлементКоллекции = Родитель;
            Родитель = ЭлементКоллекции.ПолучитьРодителя();
        КонецЦикла;

    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СхемаРасчетаПриИзменении(Элемент)
	
	ИнициализироватьНастройки();

КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзТекстовогоПоляПродолжение", ЭтаФорма, Неопределено);
	
	ПоказатьВводСтроки(
		ОписаниеОповещения, 
		"", 
		НСтр("ru = 'Введите артикула товаров с новой строки или через запятую'; uk = 'Введіть артикули товарів з нової строки або через кому'"),
		0,
		Истина);
		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТекстовогоПоляПродолжение(Текст, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Текст) Тогда 
		Возврат;
	КонецЕсли;

	ЗагрузитьИзТекстовогоПоляНаСервере(Текст);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзТекстовогоПоляНаСервере(Текст)
	
	НовТекст = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(",.-;", Текст, Символы.ПС);	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(НовТекст, Символы.ПС);
	СписокНоменклатуры = Новый СписокЗначений;
	
	Для Каждого Стр Из МассивСтрок Цикл 
		текСтр = СокрЛП(Стр);
		
		Если ПустаяСтрока(текСтр) Тогда 
			Продолжить;
		ИначеЕсли Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(текСтр) Тогда 
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Неверный формат артикула ""%1""'; uk = 'Невірний формат артикулу ""%1""'"),
					текСтр));
		Иначе
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", текСтр);	
			Если Не Номенклатура.Пустая() Тогда 
				НоваяСтрока = СписокНоменклатуры.Добавить(Номенклатура);
			Иначе
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не найдена номенклатура с артикулом ""%1""'; uk = 'Не знайдена номенклатура з артикулом ""%1""'"),
						текСтр));					
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьОтборСКД("Номенклатура", ВидСравненияКомпоновкиДанных.ВСписке, СписокНоменклатуры);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСКД(ИмяПоля, ВидОтбора, Значение)
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ОтборыКомпановщика = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	Для Каждого Стр Из ОтборыКомпановщика Цикл
		Если Стр.ЛевоеЗначение = ПолеОтбора Тогда
			Отбор = Стр;
		КонецЕсли;
	КонецЦикла;
	Если Отбор = Неопределено Тогда
		Отбор = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение  = ПолеОтбора;
	КонецЕсли;
	
	Если Значение <> Неопределено Тогда
		Отбор.ВидСравнения   = ВидОтбора;
		Отбор.Использование  = Истина;
		Отбор.ПравоеЗначение  = Значение;
	Иначе
		Отбор.Использование  = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
